#+TITLE: Shell

** Shell Parameter Expansion
- https://www.gnu.org/software/bash/manual/bashref.html#Shell-Parameter-Expansion

#+BEGIN_SRC shell
  ${parameter:-word} # parameter if parameter else word
  ${parameter:=word} # if not parameter: parameter = word; parameter
  ${parameter:?word} # if not parameter: stderr.write(word); exit; else: parameter
  ${parameter:+word} # if not parameter: '' else word
#+END_SRC

#+BEGIN_SRC shell
  ${parameter:offset}        # parameter[offset:]
  ${parameter:offset:length} # parameter[offset:offset+length]
#+END_SRC

#+BEGIN_SRC shell :outputs
  # ${parameter/pattern/string}
  #   longest match of pattern, If pattern begins with ‘/’, matches all
  export FOO='a.b.c.d'
  echo "${FOO/[.]/-}"
  echo "${FOO//[.]/-}"
#+END_SRC

#+RESULTS:
| a-b.c.d |
| a-b-c-d |

